app/views/users/show.html.erb

<body>
<% Location.all.each do |location|%>
---
SELECT "locations".* FROM "locations"