app/controllers/activities_controller.rb

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @activity = Activity.find(params[:id])

SELECT  "activities".* FROM "activities" WHERE ("activities"."length" BETWEEN ? AND ?) ORDER BY "activities"."id" ASC LIMIT ?  [["length", 15], ["length", 35], ["LIMIT", 1]]
---
  def get
      given_time = params[:length].to_i
      start_range = given_time - 10
      end_range = given_time + 10
      @chosen_activity = Activity.where(length: start_range..end_range).take

SELECT "activities".* FROM "activities"
---
  def show

    @all_activities = Activity.all

INSERT INTO "activities" ("name", "length", "description", "created_at", "updated_at", "user_id", "category") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "doing stuff"], ["length", 5], ["description", "asdf"], ["created_at", "2018-04-26 07:15:06.173508"], ["updated_at", "2018-04-26 07:15:06.173508"], ["user_id", 4], ["category", "Sports"]]
---
  def create

    @activity = current_user.activities.build(activity_params)
    if @activity.save