app/controllers/locations_controller.rb

SELECT locations.*, (69.09332411348201 * ABS(locations.latitude - 37.8715926) * 0.7071067811865475) + (59.836573914187355 * ABS(locations.longitude - -122.272747) * 0.7071067811865475) AS distance, CASE WHEN (locations.latitude >= 37.8715926 AND locations.longitude >= -122.272747) THEN  45.0 WHEN (locations.latitude <  37.8715926 AND locations.longitude >= -122.272747) THEN 135.0 WHEN (locations.latitude <  37.8715926 AND locations.longitude <  -122.272747) THEN 225.0 WHEN (locations.latitude >= 37.8715926 AND locations.longitude <  -122.272747) THEN 315.0 END AS bearing FROM "locations" WHERE (locations.latitude BETWEEN 37.14793368444576 AND 38.59525151555424 AND locations.longitude BETWEEN -123.1894804814442 AND -121.35601351855578) ORDER BY "locations"."distance" ASC
---
  def index
    if params[:search].present?
      @locations = Location.near(params[:search], 50, :order => :distance)
    else
      @locations = Location.all

SELECT locations.*, (69.09332411348201 * ABS(locations.latitude - 37.8718992) * 0.7071067811865475) + (59.836573914187355 * ABS(locations.longitude - -122.2585399) * 0.7071067811865475) AS distance, CASE WHEN (locations.latitude >= 37.8718992 AND locations.longitude >= -122.2585399) THEN  45.0 WHEN (locations.latitude <  37.8718992 AND locations.longitude >= -122.2585399) THEN 135.0 WHEN (locations.latitude <  37.8718992 AND locations.longitude <  -122.2585399) THEN 225.0 WHEN (locations.latitude >= 37.8718992 AND locations.longitude <  -122.2585399) THEN 315.0 END AS bearing FROM "locations" WHERE (locations.latitude BETWEEN 37.72716741688915 AND 38.01663098311085 AND locations.longitude BETWEEN -122.44188735929562 AND -122.07519244070438 AND locations.id != 1) ORDER BY distance ASC
---
  def show
    @location = Location.find(params[:id])

INSERT INTO "locations" ("address", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "UC Berkeley"], ["latitude", 37.8718992], ["longitude", -122.2585399], ["created_at", "2018-04-26 04:46:07.862359"], ["updated_at", "2018-04-26 04:46:07.862359"]]
---
  def create
    @location = Location.new(location_params)
    if @location.save

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @location = Location.find(params[:id])