app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "activity_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["comment", "aewsome time"], ["created_at", "2018-04-26 06:04:27.371936"], ["updated_at", "2018-04-26 06:04:27.371936"], ["user_id", 4], ["activity_id", 1]]
---
  def create
    @review = Review.new(review_params)
    puts current_user.id
    @review.user_id = current_user.id
    # puts @activity_id
    @review.activity_id = @activity.id

    respond_to do |format|
      if @review.save

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_activity
    	@activity = Activity.find(params[:activity_id])