app/controllers/users_controller.rb

UPDATE "users" SET "location" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["location", "BERKELEY"], ["updated_at", "2018-04-24 21:34:06.515319"], ["id", 1]]
---
	def update_location
		# puts params[:user][:location]
		puts "UPDATING LOCATION"
		puts user_params[:location]
		current_user.update(location: user_params[:location])