app/views/activities/index.html.erb


<% if @activity.reviews.blank? %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."activity_id" = ?  [["activity_id", 2]]