app/views/activities/index.html.erb

SELECT "activities".* FROM "activities" WHERE "activities"."user_id" = ?  [["user_id", 1]]
---
<tbody>
	<% current_user.activities.each do |a| %>