app/views/activities/my_activities.html.erb

SELECT "activities".* FROM "activities" WHERE "activities"."user_id" = ?  [["user_id", 4]]
---
<tbody>
	<% current_user.activities.each do |a| %>